Revit 2027 API
BuiltInFailures.SketchFailures.RebarManyLoops Property
 Rebar Sketch contains more than one loop. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarManyLoops { get; }
Public Shared ReadOnly Property RebarManyLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarManyLoops {
	FailureDefinitionId^ get ();
}
static member RebarManyLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace